fluidized_bed_1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 0 0)
    (4 0 0)
    (4 20 0)
    (0 20 0)
    (0 0 0.75)
    (4 0 0.75)
    (4 20 0.75)
    (0 20 0.75)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (25 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inletWalls
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    outletWalls
    {
	type wall;
	faces
	(
	    (3 7 6 2)
	);
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
	    (0 3 2 1)
	    (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
